"""Создать переменную a, значение которой определяется через ввод данных с клавиатуры.
Создать переменную b, значение которой определяется через ввод данных с клавиатуры.
Вывести на экран сумму двух введенных чисел, если для 'a' было введено 123,
а для b 431, то на экран должно быть выведено 554.
"""


a = int(input("Введите число a: "))
b = int(input("Введите число b: "))

sum_ab = a + b
print("Сумма чисел a и b:", sum_ab)



