"""
Вывести строку "Hello, world!" (без кавычек) в консоль с помощью функции print.
"""

print("Hello, world!")

"""
Выведите строку в консоли “Я люблю:”, а затем 3 пронумерованных пункта с тем, что вам нравится.
"""

print("Я люблю:")
print("1. Читать книги")
print("2. Путешествовать")
print("3. Программировать")
