"""Шифр.
Есть сообщение (строка):
"2__234йшDGмёшSDFжкъrrrщзнSDF78юкйфуSDFшёью$#2Sшжйи3%узфsdf34нкфыvvя"
И ключ к шифру, где каждую букву нужно заменить на ее значение в словаре:
cipher = {
    "а": "щ", "б": "д", "в": "ю", "г": "ф", "д": "з", "е": "м", "ё": "р",
    "ж": "т", "з": "п", "и": "я", "й": "с", "к": "н", "л": "э", "м": "к",
    "н": "л", "о": "ё", "п": "ж", "р": "ц", "с": "б", "т": "у", "у": "в",
    "ф": "о", "х": "и", "ц": "х", "ч": "г", "ш": "е", "щ": "й", "ъ": "ы",
    "ы": "ч", "ь": "ш", "э": "ъ", "ю": "а", "я": "ь"
}
Расшифруйте секретное сообщение с помощью ключа cipher, при этом мусорные значение (которых нет в словаре) должны быть пропущены и не добавлены в результат.
Выведите результат на экран.
Дополнительно: напишите программу, которая получает строку через ввод с клавиатуры и “отправляет” зашифрованный ответ агенту.
"""

cipher = {
    "а": "щ", "б": "д", "в": "ю", "г": "ф", "д": "з", "е": "м", "ё": "р",
    "ж": "т", "з": "п", "и": "я", "й": "с", "к": "н", "л": "э", "м": "к",
    "н": "л", "о": "ё", "п": "ж", "р": "ц", "с": "б", "т": "у", "у": "в",
    "ф": "о", "х": "и", "ц": "х", "ч": "г", "ш": "е", "щ": "й", "ъ": "ы",
    "ы": "ч", "ь": "ш", "э": "ъ", "ю": "а", "я": "ь"
}

# Обратный словарь для шифрования
reverse_cipher = {v: k for k, v in cipher.items()}

# Зашифрованное сообщение
message = "2__234йшDGмёшSDFжкъrrrщзнSDF78юкйфуSDFшёью$#2Sшжйи3%узфsdf34нкфыvvя"

# Расшифровка
decoded_message = "".join(cipher[char] for char in message if char in cipher)
print("Расшифрованное сообщение:", decoded_message)

# Ввод пользователя и шифрование
user_input = input("Введите сообщение для шифрования: ")
encoded_message = "".join(reverse_cipher[char] for char in user_input if char in reverse_cipher)
print("Зашифрованное сообщение:", encoded_message)

